class Question:
	def __init__(self, text, wrong, right):
		self.text = text
		self.wrong = wrong
		self.right = right

tests = {}
tests[1] = {}
tests[1][1] = Question('1. Радиотолқындар тиімді тарала алатын жиілік?', \
	['50 Гц', '300 Гц', '10000 Гц'], '30000 Гц')
tests[1][2] = Question('2. Біртекті жазық толқында Е және H векторлары өзара?', \
	['Параллель','Көлденең','Коллинеар'], 'Перпендикуляр')
tests[1][3] = Question('3. Нормаль арқылы шекаралық бөлікке параллельді бағытталған жазықтық қалай аталады?', \
	['Сәулелену жазықтығы','Шағылу жазықтығы','Сыну жазықтығы'], 'Түсу жазықтығы')
tests[1][4] = Question('4. Толқынжол (волновод)  бойымен таралуы мүмкін ең үлкен толқын ұзындығы қалай аталады?', \
	['Толқынжол толқын ұзындығы','Жарық толқын ұзындығы','Жартытолқын толқын ұзындығы'], 'Критикалық толқын ұзыныдығы')
tests[1][5] = Question('5. Коаксиалды толқынжол – бұл?', \
	['шексіз ұзын радиусы а болатын диэлектриктік цилиндр','диэлектрик арқылы бөлінген екі осьтес (осьтері бірдей) металл түтік','көлденең қимасы тікбұрышты болып келетін идеалды өткізгіш металл түтік'], 'диэлектрик арқылы бөлінген екі осьтес (осьтері бірдей) металл цилиндр')
tests[1][6] = Question('6. Диэлектрлік толқынжол – бұл?', \
	['диэлектрик арқылы бөлінген екі осьтес (осьтері бірдей) металл цилиндр','көлденең қимасы тікбұрышты болып келетін идеалды өткізгіш металл түтік','диэлектрик арқылы бөлінген екі осьтес (осьтері бірдей) металл түтік'], 'шексіз ұзын радиусы а болатын диэлектриктік цилиндр')
tests[1][7] = Question('7. Жолақты желілер қай типті бағытталған жүйеге жатады?', \
	['Жабық типті','Аралас типті','Ешқайсына жатпайды'], 'Ашық типті')
tests[1][8] = Question('8. Қандай да бір координата бойымен таралатын және жазықтықтағы әрбір уақыт мезетінде Е(z,t) координатаға перпендикуляр болып келетін толқынды атайды?', \
	['Біртекті жазық толқын','Көлденең толқын','Толқындық фронт'], 'Жазық толқын')
tests[1][9] = Question('9. Дөңгелек метал толқынжолдың көлденең қимасының радиусы?', \
	['r < a','r > a ','r = 2a'], 'r = a')
tests[1][10] = Question('10. Магнит өрісінің электр өрісінен айырмашылығы?', \
	['Лоренц күшімен сипатталады','Фарадей заңымен сипатталады','Кернеулікпен сипатталады'], 'Индукция векторымен сипатталады')
